In [3]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\programdata\anaconda3\lib\site-packages (1.2.0)

In [4]:
import pandas as pd

In [6]:
csv_path = 'https://stats.govt.nz/assets/Uploads/Annual-enterprise-survey/Annual-enterprise-survey-2021-financial-year-provisional/Download-data/annual-enterprise-survey-2021-financial-year-provisional-csv.csv'
df = pd.read_csv(csv_path)

In [10]:
df.head(10)

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2021,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...
2,2021,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...
3,2021,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"33,020",ANZSIC06 divisions A-S (excluding classes K633...
4,2021,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...
5,2021,Level 1,99999,All industries,Dollars (millions),H09,Interest and donations,Financial performance,"26,138",ANZSIC06 divisions A-S (excluding classes K633...
6,2021,Level 1,99999,All industries,Dollars (millions),H10,Indirect taxes,Financial performance,"6,991",ANZSIC06 divisions A-S (excluding classes K633...
7,2021,Level 1,99999,All industries,Dollars (millions),H11,Depreciation,Financial performance,"27,801",ANZSIC06 divisions A-S (excluding classes K633...
8,2021,Level 1,99999,All industries,Dollars (millions),H12,Salaries and wages paid,Financial performance,"123,620",ANZSIC06 divisions A-S (excluding classes K633...
9,2021,Level 1,99999,All industries,Dollars (millions),H13,Redundancy and severance,Financial performance,275,ANZSIC06 divisions A-S (excluding classes K633...

In [16]:
selectColumn = df[['Variable_category', 'Industry_code_NZSIOC', 'Value']]
selectColumn

           Variable_category Industry_code_NZSIOC    Value
0      Financial performance                99999  757,504
1      Financial performance                99999  674,890
2      Financial performance                99999   49,593
3      Financial performance                99999   33,020
4      Financial performance                99999  654,404
...                      ...                  ...      ...
41710       Financial ratios                 ZZ11       52
41711       Financial ratios                 ZZ11       40
41712       Financial ratios                 ZZ11       12
41713       Financial ratios                 ZZ11        5
41714       Financial ratios                 ZZ11       46

[41715 rows x 3 columns]

In [17]:
x = df['Value']
x

0        757,504
1        674,890
2         49,593
3         33,020
4        654,404
          ...
41710         52
41711         40
41712         12
41713          5
41714         46
Name: Value, Length: 41715, dtype: object

In [19]:
x = df[['Value']]
x

         Value
0      757,504
1      674,890
2       49,593
3       33,020
4      654,404
...        ...
41710       52
41711       40
41712       12
41713        5
41714       46

[41715 rows x 1 columns]

In [21]:
x = df[['Variable_category']]
type(x)

pandas.core.frame.DataFrame

In [41]:
selectColumn = df[['Variable_category', 'Value', 'Industry_code_NZSIOC']]
selectColumn

           Variable_category    Value Industry_code_NZSIOC
0      Financial performance  757,504                99999
1      Financial performance  674,890                99999
2      Financial performance   49,593                99999
3      Financial performance   33,020                99999
4      Financial performance  654,404                99999
...                      ...      ...                  ...
41710       Financial ratios       52                 ZZ11
41711       Financial ratios       40                 ZZ11
41712       Financial ratios       12                 ZZ11
41713       Financial ratios        5                 ZZ11
41714       Financial ratios       46                 ZZ11

[41715 rows x 3 columns]

In [42]:
selectColumn.iloc[0, 0]

'Financial performance'

In [43]:
selectColumn.iloc[3, 1]

'33,020'

In [44]:
selectColumn.iloc[41713, 1]

'5'

In [51]:
selectColumn.loc[41710, 'Industry_code_NZSIOC']

'ZZ11'

In [54]:
selectColumn.iloc[0:4, 0:3]

       Variable_category    Value Industry_code_NZSIOC
0  Financial performance  757,504                99999
1  Financial performance  674,890                99999
2  Financial performance   49,593                99999
3  Financial performance   33,020                99999

In [55]:
selectColumn.loc[0:3, 'Variable_category':'Industry_code_NZSIOC']

       Variable_category    Value Industry_code_NZSIOC
0  Financial performance  757,504                99999
1  Financial performance  674,890                99999
2  Financial performance   49,593                99999
3  Financial performance   33,020                99999